## Plan for aws/lambda
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 1 to add, 1 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                 NAME                  |
|--------|---------------------------------------|
| add    | `aws_cloudfront_distribution.api`     |
| update | `module.api.aws_lambda_function.this` |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_cloudfront_distribution.api will be created
  + resource "aws_cloudfront_distribution" "api" {
      + aliases                         = [
          + "encrypted-message.cdssandbox.xyz",
        ]
      + arn                             = (known after apply)
      + caller_reference                = (known after apply)
      + continuous_deployment_policy_id = (known after apply)
      + domain_name                     = (known after apply)
      + enabled                         = true
      + etag                            = (known after apply)
      + hosted_zone_id                  = (known after apply)
      + http_version                    = "http2"
      + id                              = (known after apply)
      + in_progress_validation_batches  = (known after apply)
      + is_ipv6_enabled                 = false
      + last_modified_time              = (known after apply)
      + price_class                     = "PriceClass_100"
      + retain_on_delete                = false
      + staging                         = false
      + status                          = (known after apply)
      + tags                            = {
          + "CostCentre" = "secret"
          + "Terraform"  = "true"
        }
      + tags_all                        = {
          + "CostCentre" = "secret"
          + "Terraform"  = "true"
        }
      + trusted_key_groups              = (known after apply)
      + trusted_signers                 = (known after apply)
      + wait_for_deployment             = true

      + default_cache_behavior {
          + allowed_methods            = [
              + "DELETE",
              + "GET",
              + "HEAD",
              + "OPTIONS",
              + "PATCH",
              + "POST",
              + "PUT",
            ]
          + cached_methods             = [
              + "GET",
              + "HEAD",
            ]
          + compress                   = true
          + default_ttl                = 86400
          + max_ttl                    = 31536000
          + min_ttl                    = 1
          + response_headers_policy_id = "623276b7-6b0f-42d8-a3de-61c08a4c9348"
          + target_origin_id           = "secret-production-api"
          + trusted_key_groups         = (known after apply)
          + trusted_signers            = (known after apply)
          + viewer_protocol_policy     = "redirect-to-https"

          + forwarded_values {
              + headers                 = (known after apply)
              + query_string            = true
              + query_string_cache_keys = (known after apply)

              + cookies {
                  + forward           = "none"
                  + whitelisted_names = (known after apply)
                }
            }
        }

      + ordered_cache_behavior {
          + allowed_methods            = [
              + "GET",
              + "HEAD",
            ]
          + cached_methods             = [
              + "GET",
              + "HEAD",
            ]
          + compress                   = true
          + default_ttl                = 0
          + max_ttl                    = 0
          + min_ttl                    = 0
          + path_pattern               = "/version"
          + response_headers_policy_id = "623276b7-6b0f-42d8-a3de-61c08a4c9348"
          + target_origin_id           = "secret-production-api"
          + viewer_protocol_policy     = "redirect-to-https"

          + forwarded_values {
              + headers                 = (known after apply)
              + query_string            = false
              + query_string_cache_keys = (known after apply)

              + cookies {
                  + forward = "none"
                }
            }
        }

      + origin {
          + connection_attempts = 3
          + connection_timeout  = 10
          + domain_name         = "saro7nay3ecry453d5c7fwmph40hucwx.lambda-url.ca-central-1.on.aws"
          + origin_id           = "secret-production-api"

          + custom_header {
              + name  = "X-CloudFront-Header"
              + value = "secret-production-api"
            }

          + custom_origin_config {
              + http_port                = 80
              + https_port               = 443
              + origin_keepalive_timeout = 5
              + origin_protocol_policy   = "https-only"
              + origin_read_timeout      = 60
              + origin_ssl_protocols     = [
                  + "TLSv1.2",
                ]
            }
        }

      + restrictions {
          + geo_restriction {
              + locations        = (known after apply)
              + restriction_type = "none"
            }
        }

      + viewer_certificate {
          + acm_certificate_arn      = "arn:aws:acm:us-east-1:637287734259:certificate/24f38821-07f1-4f2e-a9cb-a946ea86a6b6"
          + minimum_protocol_version = "TLSv1.2_2021"
          + ssl_support_method       = "sni-only"
        }
    }

  # module.api.aws_lambda_function.this will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        architectures                  = [
            "x86_64",
        ]
        arn                            = "arn:aws:lambda:ca-central-1:637287734259:function:secret-production-api"
        function_name                  = "secret-production-api"
        id                             = "secret-production-api"
        image_uri                      = "637287734259.dkr.ecr.ca-central-1.amazonaws.com/secret/app:latest"
        invoke_arn                     = "arn:aws:apigateway:ca-central-1:lambda:path/2015-03-31/functions/arn:aws:lambda:ca-central-1:637287734259:function:secret-production-api/invocations"
        last_modified                  = "2024-01-23T14:13:02.258+0000"
        layers                         = []
        memory_size                    = 128
        package_type                   = "Image"
        publish                        = false
        qualified_arn                  = "arn:aws:lambda:ca-central-1:637287734259:function:secret-production-api:$LATEST"
        qualified_invoke_arn           = "arn:aws:apigateway:ca-central-1:lambda:path/2015-03-31/functions/arn:aws:lambda:ca-central-1:637287734259:function:secret-production-api:$LATEST/invocations"
        reserved_concurrent_executions = -1
        role                           = "arn:aws:iam::637287734259:role/secret-production-api"
        skip_destroy                   = false
        source_code_hash               = "b32a5d5b121b03a780b4071d58cd622d79902fb29fe147c3baf5b80baad92356"
        source_code_size               = 0
        tags                           = {
            "CostCentre" = "secret"
            "Terraform"  = "true"
        }
        tags_all                       = {
            "CostCentre" = "secret"
            "Terraform"  = "true"
        }
        timeout                        = 60
        version                        = "$LATEST"

      ~ environment {
          ~ variables = {
                "DYNAMO_TABLE" = "secret-production-table"
                "ENV"          = "PRODUCTION"
              ~ "GIT_SHA"      = "1da1205558bc19602579652edb51bc16b4973691" -> "abcdefgh"
                "KMS_ID"       = "5e112d26-23c0-473d-afbb-2c74deab0894"
            }
        }

        ephemeral_storage {
            size = 512
        }

        logging_config {
            log_format = "Text"
            log_group  = "/aws/lambda/secret-production-api"
        }

        tracing_config {
            mode = "PassThrough"
        }
    }

Plan: 1 to add, 1 to change, 0 to destroy.

------------------------------------------------------------------------

This plan was saved to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"


```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.every-three-minutes"]
WARN - plan.json - main - Missing Common Tags: ["aws_dynamodb_table.dynamodb-table"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.lambda-iam-role"]
WARN - plan.json - main - Missing Common Tags: ["aws_kms_key.key"]
WARN - plan.json - main - Missing Common Tags: ["aws_lambda_function.lambda-warmer"]

24 tests, 19 passed, 5 warnings, 0 failures, 0 exceptions

```

</details>
